## 일/주/월/분기별 매출액 및 주문 건수

In [1]:
import pandas as pd 
from sqlalchemy import create_engine

In [2]:
conn_string = 'postgresql://postgres:admin1234@localhost:5432/postgres'
postgres_engine = create_engine(conn_string)

### 일별

In [11]:
query = """
    SELECT  
        date_trunc('day', order_date)::date
        , sum(amount)
        , count(distinct o.order_id) as daily_order_cnt
    FROM nw.orders o
    JOIN nw.order_items oi 
    ON o.order_id = oi.order_id
    GROUP BY date_trunc('day', order_date)::date
    ORDER BY date_trunc('day', order_date)::date
"""

df = pd.read_sql_query(sql=query, con=postgres_engine)
df.head()

   date_trunc      sum  daily_order_cnt
0  1996-07-04   440.00                1
1  1996-07-05  1863.40                1
2  1996-07-08  2206.66                2
3  1996-07-09  3597.90                1
4  1996-07-10  1444.80                1

### 주별

In [14]:
query = """
    SELECT  
        date_trunc('week', order_date)::date
        , sum(amount)
        , count(distinct o.order_id) as weekly_order_cnt
    FROM nw.orders o
    JOIN nw.order_items oi 
    ON o.order_id = oi.order_id
    GROUP BY date_trunc('week', order_date)::date
    ORDER BY date_trunc('week', order_date)::date
"""

df = pd.read_sql_query(sql=query, con=postgres_engine)
df.head()

   date_trunc       sum  weekly_order_cnt
0  1996-07-01   2303.40                 2
1  1996-07-08  10296.48                 6
2  1996-07-15   5306.03                 6
3  1996-07-22   4675.98                 5
4  1996-07-29   8160.00                 6

### 월별

In [15]:
query = """
    SELECT  
        date_trunc('month', order_date)::date
        , sum(amount)
        , count(distinct o.order_id) as monthly_order_cnt
    FROM nw.orders o
    JOIN nw.order_items oi 
    ON o.order_id = oi.order_id
    GROUP BY date_trunc('month', order_date)::date
    ORDER BY date_trunc('month', order_date)::date
"""

df = pd.read_sql_query(sql=query, con=postgres_engine)
df.head()

   date_trunc       sum  monthly_order_cnt
0  1996-07-01  27861.89                 22
1  1996-08-01  25485.27                 25
2  1996-09-01  26381.40                 23
3  1996-10-01  37515.72                 26
4  1996-11-01  45600.04                 25

### 분기별 매출

In [16]:
query = """
    SELECT  
        date_trunc('quarter', order_date)::date
        , sum(amount)
        , count(distinct o.order_id) as quarterly_order_cnt
    FROM nw.orders o
    JOIN nw.order_items oi 
    ON o.order_id = oi.order_id
    GROUP BY date_trunc('quarter', order_date)::date
    ORDER BY date_trunc('quarter', order_date)::date
"""

df = pd.read_sql_query(sql=query, con=postgres_engine)
df.head()

   date_trunc        sum  quarterly_order_cnt
0  1996-07-01   79728.56                   70
1  1996-10-01  128355.39                   82
2  1997-01-01  138288.90                   92
3  1997-04-01  143177.03                   93
4  1997-07-01  153937.74                  103